[
  {
    "title": "Systemic Kindness: Building Methodology That Feels Supportive",
    "excerpt": "“You’ve got this!”August 14“Systematize kindness, and systematize excellence in a kind fashion.”That phrase stopped me in my tracks during today’s planning session. We were discussing how Piper cou...",
    "url": "https://medium.com/building-piper-morgan/systemic-kindness-building-methodology-that-feels-supportive-f38cde251d9d?source=rss----982e21163f8b---4",
    "publishedAt": "Oct 11, 2025",
    "publishedAtISO": "Sat, 11 Oct 2025 13:36:39 GMT",
    "author": "christian crumlish",
    "readingTime": "5 min read",
    "tags": [
      "Building in Public"
    ],
    "guid": "https://medium.com/p/f38cde251d9d",
    "featuredImage": "https://cdn-images-1.medium.com/max/1024/1*By20zSUIkSFsK3awaA3_PA.png",
    "slug": "systemic-kindness"
  },
  {
    "title": "Three Days to Production: When Steady Momentum Beats Racing Ahead",
    "excerpt": "“We made it!”October 4At 6:48 PM on Saturday, my Lead Developer sent the final validation report for GREAT-3D. The numbers were almost absurd: 120 plugin tests passing, performance targets exceeded...",
    "url": "https://medium.com/building-piper-morgan/three-days-to-production-when-steady-momentum-beats-racing-ahead-04799048f5ea?source=rss----982e21163f8b---4",
    "publishedAt": "Oct 10, 2025",
    "publishedAtISO": "Fri, 10 Oct 2025 14:26:01 GMT",
    "author": "christian crumlish",
    "readingTime": "5 min read",
    "tags": [
      "Building in Public"
    ],
    "guid": "https://medium.com/p/04799048f5ea",
    "featuredImage": "https://cdn-images-1.medium.com/max/1024/1*1pOsvI3NFCnH6oMYc0Ikpg.png",
    "slug": "three-days-to-production"
  },
  {
    "title": "The Day Everything Went Right: When Fast Means Unbroken",
    "excerpt": "“Mornin’ boss!”October 3At 4:50 PM on Friday, my Lead Developer — Claude Sonnet 4.5, if we’re being formal — sent me the completion summary for GREAT-3B. The numbers looked almost suspicious: 48 te...",
    "url": "https://medium.com/building-piper-morgan/the-day-everything-went-right-when-fast-means-unbroken-b859b2b9de2f?source=rss----982e21163f8b---4",
    "publishedAt": "Oct 10, 2025",
    "publishedAtISO": "Fri, 10 Oct 2025 14:09:55 GMT",
    "author": "christian crumlish",
    "readingTime": "5 min read",
    "tags": [
      "Building in Public"
    ],
    "guid": "https://medium.com/p/b859b2b9de2f",
    "featuredImage": "https://cdn-images-1.medium.com/max/1024/1*Tmfjf6aZvJjZORv3g6V_xg.png",
    "slug": "the-day-everything-went-right"
  },
  {
    "title": "The Plugin Architecture Nobody Asked For",
    "excerpt": "“It powers anything!”October 3Yesterday we built a plugin system for four plugins. If that sounds like over-engineering, let me explain why it’s not completely ridiculous.The setupGREAT-3A — our th...",
    "url": "https://medium.com/building-piper-morgan/the-plugin-architecture-nobody-asked-for-650da4a52669?source=rss----982e21163f8b---4",
    "publishedAt": "Oct 9, 2025",
    "publishedAtISO": "Thu, 09 Oct 2025 12:54:52 GMT",
    "author": "christian crumlish",
    "readingTime": "5 min read",
    "tags": [
      "Building in Public"
    ],
    "guid": "https://medium.com/p/650da4a52669",
    "featuredImage": "https://cdn-images-1.medium.com/max/1024/1*rl2Iv59lNeDhQlcUVK27hw.png",
    "slug": "the-plugin-architecture-nobody-asked-for"
  },
  {
    "title": "The Third Pattern: When Investigation Rewrites Your Assumptions",
    "excerpt": "“The rain tastes like yesterday’s regrets…”October 1We started the day with a clear mission: Calendar integration was the only service without spatial intelligence, sitting at 85% complete with a s...",
    "url": "https://medium.com/building-piper-morgan/the-third-pattern-when-investigation-rewrites-your-assumptions-ffc8f69c6327?source=rss----982e21163f8b---4",
    "publishedAt": "Oct 8, 2025",
    "publishedAtISO": "Wed, 08 Oct 2025 13:55:10 GMT",
    "author": "christian crumlish",
    "readingTime": "5 min read",
    "tags": [
      "Building in Public"
    ],
    "guid": "https://medium.com/p/ffc8f69c6327",
    "featuredImage": "https://cdn-images-1.medium.com/max/1024/1*JCe7VbCsXTy7tiNHHvwtIQ.png",
    "slug": "the-third-pattern"
  },
  {
    "title": "Think Like a Time Lord and Stop Watching the Clock",
    "excerpt": "“We have all the time we need”September 30A day without drama: Tuesday’s GREAT-2C session completed in 2 hours and 7 minutes with zero major issues, two sophisticated spatial architectures verified...",
    "url": "https://medium.com/building-piper-morgan/think-like-a-time-lord-and-stop-watching-the-clock-71b3b5ee49a0?source=rss----982e21163f8b---4",
    "publishedAt": "Oct 7, 2025",
    "publishedAtISO": "Tue, 07 Oct 2025 14:02:39 GMT",
    "author": "christian crumlish",
    "readingTime": "5 min read",
    "tags": [
      "Building in Public"
    ],
    "guid": "https://medium.com/p/71b3b5ee49a0",
    "featuredImage": "https://cdn-images-1.medium.com/max/1024/1*Rkep1oaUr5cQMxpTzyxYzg.png",
    "slug": "think-like-a-time-lord-and"
  },
  {
    "title": "Solving the 80% Pattern",
    "excerpt": "September 29Monday morning at 9:37 AM, with all three routers complete from Sunday night’s work, the migration phase looked straightforward. Six services importing adapters directly. Replace import...",
    "url": "https://medium.com/building-piper-morgan/solving-the-80-pattern-a1dc0ddb8966?source=rss----982e21163f8b---4",
    "publishedAt": "Oct 6, 2025",
    "publishedAtISO": "Mon, 06 Oct 2025 13:10:39 GMT",
    "author": "christian crumlish",
    "readingTime": "5 min read",
    "tags": [
      "Building in Public"
    ],
    "guid": "https://medium.com/p/a1dc0ddb8966",
    "featuredImage": "https://cdn-images-1.medium.com/max/1024/1*MYde63qnUEaEhNwBNME-OA.png",
    "slug": "solving-the-80-pattern"
  },
  {
    "title": "Three Integrations Walk Into a Bar",
    "excerpt": "“What’ll it be?”September 28Sunday afternoon at 4:14 PM, I opened my laptop expecting a straightforward router completion task. The gameplan looked clean: finish three integration routers (Slack, N...",
    "url": "https://medium.com/building-piper-morgan/three-integrations-walk-into-a-bar-f748ce4c2db1?source=rss----982e21163f8b---4",
    "publishedAt": "Oct 6, 2025",
    "publishedAtISO": "Mon, 06 Oct 2025 13:00:58 GMT",
    "author": "christian crumlish",
    "readingTime": "5 min read",
    "tags": [
      "Building in Public"
    ],
    "guid": "https://medium.com/p/f748ce4c2db1",
    "featuredImage": "https://cdn-images-1.medium.com/max/1024/1*grvkaMObknRqcbQy0H1CrA.png",
    "slug": "three-integrations-walk-into-a-bar"
  },
  {
    "title": "I Asked Claude to Find Every Time I Dropped the Ball (And What We Learned)",
    "excerpt": "“You just need reminders!”August 9, 2025Here’s a confession: I suspected I was forgetting things. Not just the usual “where did I put my keys” stuff, but systematic project things. Habits I’d plann...",
    "url": "https://medium.com/building-piper-morgan/i-asked-claude-to-find-every-time-i-dropped-the-ball-and-what-we-learned-7f74897824a7?source=rss----982e21163f8b---4",
    "publishedAt": "Oct 5, 2025",
    "publishedAtISO": "Sun, 05 Oct 2025 14:34:29 GMT",
    "author": "christian crumlish",
    "readingTime": "5 min read",
    "tags": [
      "Building in Public"
    ],
    "guid": "https://medium.com/p/7f74897824a7",
    "featuredImage": "https://cdn-images-1.medium.com/max/1024/1*irRWEbNz-co78Hr6czXlTA.png",
    "slug": "i-asked-claude-to-find-every"
  },
  {
    "title": "When Good Decisions Disappear: The Hidden Cost of Chat-Based Development",
    "excerpt": "“Where have you been?Why excellent tactical choices need systematic institutional memoryAugust 5The discoveryIt started with a routine tracking audit. We’d had an exceptional development day — the ...",
    "url": "https://medium.com/building-piper-morgan/when-good-decisions-disappear-the-hidden-cost-of-chat-based-development-4148a6ebdab1?source=rss----982e21163f8b---4",
    "publishedAt": "Oct 4, 2025",
    "publishedAtISO": "Sat, 04 Oct 2025 14:03:53 GMT",
    "author": "christian crumlish",
    "readingTime": "5 min read",
    "tags": [
      "Building in Public"
    ],
    "guid": "https://medium.com/p/4148a6ebdab1",
    "featuredImage": "https://cdn-images-1.medium.com/max/1024/1*r3WnZr3GH3bJ5jD7zhuEEw.png",
    "slug": "when-good-decisions-disappear"
  },
  {
    "title": "Why the Future of AI UX is Orchestration, Not Intelligence",
    "link": "https://medium.com/building-piper-morgan/why-the-future-of-ai-ux-is-orchestration-not-intelligence-8aacc89aecc9?source=rss----982e21163f8b---4",
    "pubDate": "Sun, 12 Oct 2025 13:37:57 GMT",
    "author": "christian crumlish",
    "content": "“You’re so smart, they said! You can do it all, they said!”August 20After months of building with multiple AI agents, a pattern keeps emerging: We create sophisticated systems, lose track of what we built, then rediscover our own achievements through “archaeological” investigation.This recurring ...",
    "contentSnippet": "“You’re so smart, they said! You can do it all, they said!”August 20After months of building with multiple AI agents, a pattern keeps emerging: We create sophisticated systems, lose track of what we built, then rediscover our own achievements through “archaeological” investigation.This recurring ...",
    "guid": "https://medium.com/p/8aacc89aecc9",
    "categories": [
      "Building in Public"
    ],
    "isoDate": "2025-10-12T13:37:57.000Z",
    "fullContent": "<figure><img alt=\"The specialist robots work together in a kitchen, one timing, one chopping, one cooking while in another scene one robot with eight arms is making a huge mess at the stove\" src=\"https://cdn-images-1.medium.com/max/1024/1*-rihqLO116WVnWKXAKSGRw.png\" /><figcaption><em>“You’re so smart, they said! You can do it all, they said!”</em></figcaption></figure><p><em>August 20</em></p><p>After months of building with multiple AI agents, a pattern keeps emerging: We create sophisticated systems, lose track of what we built, then rediscover our own achievements through “archaeological” investigation.</p><p>This recurring cycle of institutional amnesia may be a bug in our process but for today’s LLM services, it’s a feature that reveals the real UX challenge ahead.</p><h3>The intelligence plateau and the orchestration valley</h3><p>The AI industry is obsessed with reasoning capabilities. Larger context windows, better chain-of-thought, more sophisticated inference. Meanwhile, anyone actually building with AI faces a different problem entirely: How do you coordinate multiple specialized capabilities without losing your mind?</p><p>Anyone reading this series has the right to question what this process may be doing to my mind at this very moment!</p><p>Yesterday we discovered 599 comprehensive smoke tests we’d apparently built and then completely forgotten. Saturday we rediscovered attribution systems we’d implemented but lost track of (in fact, I only just now remembered it again and added it to my notes to include ATTRIBUTION.md to our weekly doc sweep). Two weeks ago we found enterprise-grade feedback APIs sitting in our codebase, unmarked and uncredited.</p><p>The pattern isn’t forgetfulness — it’s that our tools for building are ahead of our tools for remembering.</p><h3>From brilliant generalists to orchestrated specialists</h3><p>The current paradigm assumes one brilliant AI that can handle anything you throw at it. The emerging paradigm recognizes that specialized tools, properly coordinated, deliver better results than generalist intelligence.</p><p>Our accidental prototype:</p><ul><li><strong>Claude Code:</strong> Architecture and systematic implementation</li><li><strong>Cursor Agent:</strong> Targeted debugging and focused fixes</li><li><strong>Chief of Staff: </strong>Coordination and strategic oversight</li><li><strong>Chief Architect: </strong>Decision-making and system design</li></ul><p>Each agent has different context levels, different strengths, different appropriate use cases. The magic isn’t in making any individual agent smarter — it’s in the orchestration patterns that let them work together effectively.</p><p>One thing this enables me to do is to have focused coherent conversations and decision-making processes always at the right level of abstraction. Early on I found that as soon as multiple contexts get mixed you get a mishmash of more generic and sloppy advice and results. It’s kind of like how if you mix too many paints you end up with the same muddy brown.</p><h3>The UX we actually need</h3><p>After coordinating multi-agent workflows for months, I’m realizing that the UX challenges aren’t about reasoning — they’re about:</p><ul><li>Context handoffs: How do you maintain working memory across agent transitions?</li><li>Coordination protocols: How do you deploy the right agent for the right task without overwhelming the human orchestrator?</li><li>Institutional memory: How do you prevent the “forgotten monuments” cycle where sophisticated systems get lost in your own complexity?</li><li>Verification workflows: How do you maintain quality when multiple agents contribute to the same outcome?</li></ul><p>Each of these is critical and urgent in its own way. Getting any of these wrong means you are just injecting chaos into your processes.</p><h3>Throwing intelligence at everything</h3><p>We keep applying intelligence solutions to orchestration problems. Need better coordination? Train a smarter model. Need better memory? Increase context windows. Need better task routing? Build more sophisticated reasoning.</p><p>Except, orchestration isn’t really an intelligence problem.<em> It’s a UX design problem</em>.</p><p>My failed adoption of the TLDR system is a perfect illustration. I absorbed something that sounded cool to me without really understanding it was intended to work with 50ms test timeouts from compiled languages, which ignores Python’s ecosystem realities. More intelligence wouldn’t have fixed the fundamental mismatch where understanding my constraints better would have.</p><h3>Affordances over algorithms</h3><p>UX for AI will be defined by:</p><p><strong>Specialized models</strong> over generalist LLMs. A focused SLM that understands database schemas will outperform a brilliant generalist that has to reason about every query from first principles.</p><p><strong>Orchestration patterns</strong> over individual agent capabilities. The system that deploys the right specialist at the right time beats the system with the smartest individual components.</p><p><strong>Context management</strong> over context windows. Better handoff protocols matter more than larger memory capacity.</p><p><strong>Coordination affordances </strong>over reasoning power. Tools that help humans orchestrate AI workflows effectively will matter more than tools that make individual AI agents more capable.</p><p>I can’t even say how these affordances will look or behave. I’m treading the cowpaths now, and hoping talented UX designers (hey, I’m just a PM these days!) can figure this out and save me all the manual work and cognitive labor I do to provide resilience and coherence via scaffolding, harness, redundancy, and other the other hacks I’ve been picking up through trial and error (and stealing ideas from other people!).</p><h3>The working memory revolution</h3><p>Our recurring “archaeological discovery” pattern reveals the real frontier: building systems that maintain institutional memory across time, people, and context switches.</p><p>Every time we rediscover forgotten excellence, we’re experiencing the same challenge every team building with AI will face: How do you scale human-AI collaboration without losing track of what you’ve accomplished?</p><h3>Orchestration as a new kind of literacy</h3><p>Pretty soon, prompting individual AI agents effectively will stop being the valuable skill (or parlor trick) it is today. What we’re going to look for is the ability to orchestrate multiple specialized AI capabilities without losing coherence.</p><p>Product managers will need orchestration patterns for coordinating AI-augmented workflows across teams.</p><p>Designers will need to make (and use!) affordances for human-AI collaboration that maintain user agency while leveraging AI capabilities.</p><p>Engineers will need architecture patterns for composing AI services without creating coordination overhead.</p><h3>The Piper Morgan thesis</h3><p>While I am definitely building a product management tool, I find I am also prototyping the UX patterns that are like to define human-AI collaboration, or at least point us in the right direction, over the next decade.</p><p>I always knew this was a learning project. I sincerely want ship v1 of Piper Morgan and deliver value to myself and ideally others as well. At the same time it’s been incredibly rewarding just plunging in learning things constantly, and then turning around quickly to share my enthusiasm with all of you.</p><p>What I didn’t realize is that beyond building Piper Morgan, I may be studying just exactly the sort of interesting puzzles and problems and opportunities that the brightest minds in UX and digital software product development need to be figuring out, and fast! (Before the bad guys own it all.)</p><p>My recurring cycle of building sophisticated systems, losing track of them, and rediscovering them through archaeological investigation provides some ongoing comic relief for anyone following along, as well as an endless rollercoaster ride of elation and chagrin for me, and it also happens to be one of the fundamental challenges that every organization building with AI will face.</p><p>Smarter AI isn’t going to get us there, but better orchestration just might.</p><p><em>Next on Building Piper Morgan, we resume the daily narrative on October 5, When 75% Turns Out to Mean 100%.</em></p><p><em>This article was written through multi-agent collaboration, refined through systematic methodology, and documented with full acknowledgment that I’ll probably forget we wrote it and one of my bot pals will rediscover it archaeologically in six months and say “You have to read this amazing article somebody wrote.”</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=8aacc89aecc9\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/building-piper-morgan/why-the-future-of-ai-ux-is-orchestration-not-intelligence-8aacc89aecc9\">Why the Future of AI UX is Orchestration, Not Intelligence</a> was originally published in <a href=\"https://medium.com/building-piper-morgan\">Building Piper Morgan</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>",
    "subtitle": "",
    "canonicalLink": "https://medium.com/building-piper-morgan/why-the-future-of-ai-ux-is-orchestration-not-intelligence-8aacc89aecc9?source=rss----982e21163f8b---4",
    "thumbnail": null,
    "slug": "why-the-future-of-ai-ux"
  }
]